import React from 'react';

const SelfWork = () => {
    return (
        <div className="test-lection-content-text">
                            {/*  id={independentWork} */}
                            {/* Список с нумерованными компонентами */}
                            <ul className="num-ul">
                                <p>Самостоятельно изучить:</p>
                                <li>Финансы государства: понятие, сущность.</li>
                                <li>Воздействие государственных финансов на экономику. Фискальная политика.</li>
                                <li>Государственный бюджет.</li>
                                <li>Государственные расходы бюджета.</li>
                                <li>Формирование доходов бюджета.</li>
                                <li>Дефицит государственного бюджета.</li>
                                <li>Бюджетная стратегия РФ до 2023 года.</li>
                                <li>Принципы налогообложения.</li>
                                <li>Основные признаки налога.</li>
                                <li>Сущность налогов.</li>
                                <li>Функции налога.</li>
                                <li>Классификации налогов.</li>
                                <li>Виды налогов и типы налогообложения.</li>
                                <li>Элементы налога.</li>
                                <li>Порядок исчисления и уплаты налога.</li>
                            </ul>
                        </div>
    );
};

export default SelfWork;